swagger/EjemploCIALP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rec="http://reconfirmation.services.common.product.cdsws.bs.com" xmlns:xsd="http://reconfirmation.services.common.product.cdsws.bs.com/xsd" xmlns:xsd1="http://containers.common.product.cdsws.bs.com/xsd" xmlns:xsd2="http://datatypes.common.product.cdsws.bs.com/xsd" xmlns:xsd3="http://data.cdsws.bs.com/xsd">
  <soapenv:Header/>
   <soapenv:Body>
      <rec:retailConfirmationInput>         
         <rec:request>            
            <xsd:data>               
               <xsd1:generateTokenADD/>               
               <xsd1:hostSessionID/>               
               <xsd1:inputChannelFirma>BSO</xsd1:inputChannelFirma>               
               <xsd1:language>es_ES</xsd1:language>               
               <xsd1:origin>IE09</xsd1:origin>               
              <xsd1:parallelism/>                       
               <xsd1:registers>
                  <xsd2:register>
                     <xsd2:bank>01</xsd2:bank>
                     <xsd2:center>4149</xsd2:center>
                     <xsd2:description>descripcion CIALP</xsd2:description>
                     <xsd2:infoTagsFC>
                        <xsd2:tag>
                           <xsd2:key>importe</xsd2:key>
                           <xsd2:priority>1</xsd2:priority>
                           <xsd2:value>5000</xsd2:value>
                        </xsd2:tag>
                     </xsd2:infoTagsFC>
                     
                     <xsd2:parameters>
                        <xsd2:parameter>
                           <xsd2:key>INDFINAL</xsd2:key>
                           <xsd2:value>P</xsd2:value>
                        </xsd2:parameter>
                        <xsd2:parameter>
                           <xsd2:key>CUENTADV</xsd2:key>
                           <xsd2:value>00810001110001254227</xsd2:value>
                        </xsd2:parameter>
                        <xsd2:parameter>
                           <xsd2:key>TIPOFIRMA</xsd2:key>
                           <xsd2:value>I</xsd2:value>
                        </xsd2:parameter>
                     </xsd2:parameters>
                     <xsd2:prodCode>DV 00033</xsd2:prodCode>
                     <xsd2:prodType>ContratoCIALP</xsd2:prodType>
                     <xsd2:type>DV</xsd2:type>
                  </xsd2:register>
               </xsd1:registers>
               <xsd1:requester>17957667</xsd1:requester>
               <xsd1:signChannel>2COORDENADA</xsd1:signChannel>
               <xsd1:signers>
                  <xsd2:signer>
                     <xsd2:indPsig>S</xsd2:indPsig>
                     <xsd2:indTitGes>S</xsd2:indTitGes>
                     <xsd2:numPers>17957667</xsd2:numPers>
                     <xsd2:role>1</xsd2:role>
                  </xsd2:signer>
               </xsd1:signers>
               <xsd1:titleHolder>
                  <xsd2:cif/>
                  <xsd2:name/>
                  <xsd2:numPers>0</xsd2:numPers>
                  <xsd2:segment>P</xsd2:segment>
               </xsd1:titleHolder>
            </xsd:data>
            <xsd:header>
               <xsd3:product>BSNET</xsd3:product>
               <xsd3:sessionId>yQfrRLGfjUxl3r7BWy6JbRVdnKidQBcT1oAlm+RHcUk=</xsd3:sessionId>
            </xsd:header>
         </rec:request>
      </rec:retailConfirmationInput>
   </soapenv:Body>
</soapenv:Envelope>